# USER SENTENCE LENGTH TEST
test_sample_long = """
余华

作家,北京师范大学教授。

1960年4月出生,1983年开始写作,主要作品 有《兄弟》《活着》《许三观卖血记》《在细 雨中呼喊》《第七天》《文城》等。其作品被 翻译成40多种语言在40多个国家和地区出 版,曾获意大利格林扎纳·卡佛文学奖 (1998年)、法国文学和艺术骑士勋章 (2004年),法国国际信使外国小说奖 (2008年)、意大利朱塞佩·阿切尔比国际 文学奖(2014年),塞尔维亚伊沃,安德里 奇文学奖(2018年)、意大利波特利·拉特 斯·格林扎纳文学奖(2018年)、俄罗斯亚 斯纳亚·波利亚纳文学奖(2022年)等

|

白序

一位真正的作家永远只为内心写作,只有内心才会真实地告 诉他,他的自私,他的高尚是多么突出。内心让他真实地了解自己, 一旦了解了自己也就了解了世界。很多年前我就明白了这个原则, 可是要捍卫这个原则必须付出艰辛的劳动和长时期的痛苦,因为 内心并非时时刻刻都是敞开的,它更多的时候倒是封闭起来,于 是只有写作,不停地写作才能使内心敞开,才能使自己置身于发 现之中,就像日出的光芒照亮了黑暗,灵感这时候才会突然来到。

长期以来,我的作品都是源于和现实的那一层紧张关系。我 沉湎于想象之中,又被现实紧紧控制,我明确感受着自我的分裂, 我无法使自己变得纯粹,我曾经希望自己成为一位童话作家,要 不就是一位实实在在作品的拥有者,如果我能够成为这两者中的 任何一个,我想我内心的痛苦将轻微很多,可是与此同时我的力 量也会削弱很多。

|

事实上我只能成为现在这样的作家,我始终为内心的需要而 写作,理智代替不了我的写作,正因为此,我在很长一段时间里 是一个愤怒和冷漠的作家。

这不只是我个人面临的困难,几乎所有优秀的作家都处于和 现实的紧张关系中,在他们笔下,只有当现实处于遥远状态时, 他们作品中的现实才会闪闪发亮。应该看到,这过去的现实虽然 充满了魅力,可它已经蒙上了一层虚幻的色彩,那里面塞满了个 人想象和个人理解。真正的现实,也就是作家生活中的现实,是 令人费解和难以相处的。

作家要表达与之朝夕相处的现实,他常常会感到难以承受, 蜂拥而来的真实几乎都在诉说着丑恶和阴险,怪就怪在这里,为 什么丑恶的事物总是在身边,而美好的事物却远在海角。换句话说, 人的友爱和同情往往只是作为情绪来到,而相反的事实则是伸手 便可触及。正像一位诗人所表达的:人类无法忍受太多的真实。

也有这样的作家,一生都在解决自我和现实的紧张关系,福 克纳是一个成功的例子,他找到了一条温和的途径,他描写中间 状态的事物,同时包容了美好和丑恶,他将美国南方的现实放到 了历史和人文精神之中,这是真正意义上的文学现实,因为它连 接了过去和将来。

一些不成功的作家也在描写现实,可是他们笔下的现实说穿 了只是一个环境,是固定的,死去的现实。他们看不到人是怎样

2

|

走过来的,也看不到怎样走去,当他们在描写斤斤计较的人物时, 我们会感到作家本人也在斤斤计较。这样的作家是在写实在的作 品,而不是现实的作品。

前面已经说过,我和现实关系紧张,说得严重一点,我一直 是以敌对的态度看待现实。随着时间的推移,我内心的愤怒渐渐 平息,我开始意识到一位真正的作家所寻找的是真理,是一种排 斥道德判断的真理。作家的使命不是发泄,不是控诉或者揭露, 他应该向人们展示高尚。这里所说的高尚不是那种单纯的美好, 而是对一切事物理解之后的超然,对善和恶一视同仁,用同情的 目光看待世界。

正是在这样的心态下,我听到了一首美国民歌《老黑奴》,歌 中那位老黑奴经历了一生的苦难,家人都先他而去,而他依然友 好地对待这个世界,没有一句抱怨的话,这首歌深深地打动了我, 我决定写下一篇这样的小说,就是这篇《活着》,写人对苦难的承 受能力,对世界乐观的态度。写作过程让我明白,人是为活着本 身而活着的,而不是为了活着之外的任何事物所活着。我感到自 己写下了高尚的作品。

海盐,一九九三年七月二十七日

|
"""

test_sample_short = "从一个“史无前例”的年代到另一个史无前例的年代。从一种神秘的现实到另一种神秘的现实！刘慈欣新古典主义科幻小说的巅峰之作？"
